In [2]:
import pandas as pd

# load the data
df = pd.read_csv(r"C:\Users\NANDISHWAR\Downloads\transactions.csv")

In [3]:
df.dtypes

t_date            object
cust_id            int64
t_amt            float64
services          object
products_used     object
city              object
state             object
t_details         object
dtype: object

In [26]:
df.head(5)

,t_date,cust_id,t_amt,services,products_used,city,state,t_details
0,2015-06-26,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit
1,2015-05-26,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit
2,2015-06-01,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit
3,2015-06-05,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit
4,2015-12-17,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit

what is the total sales amount across all transactions?

In [4]:
#the total revenue  from all transactions.
df["t_amt"].sum()

np.float64(5110820.54)

Which month had the highest total transaction amount?

In [28]:
#It is the month where sales were the highest.
df["mnth"] = df["t_date"].dt.month
df.groupby("mnth")["t_amt"].sum().idxmax()

np.int32(3)

What is the average transaction amount per customer?

In [31]:
#the mean amount each customer spends per purchase on avg.
x =df.groupby("cust_id")["t_amt"].mean()
n = x.reset_index(name="Avg_Amt")
n

      cust_id     Avg_Amt
0     4000000  127.444000
1     4000001  108.945556
2     4000002   56.165000
3     4000003  123.670000
4     4000004  168.135000
...       ...         ...
9921  4009995   65.018571
9922  4009996  104.515000
9923  4009997  121.547500
9924  4009998  110.950000
9925  4009999   85.252500

[9926 rows x 2 columns]

What is the trend of total sales over months?

In [37]:
#It shows how sales go up and down month by month.
x= df.groupby(df["t_date"].dt.month)["t_amt"].sum()
n= x.reset_index(name="Sales")
n

    t_date      Sales
0        1  438165.76
1        2  395262.37
2        3  444664.24
3        4  420695.24
4        5  432627.58
5        6  421074.55
6        7  439560.80
7        8  434255.01
8        9  429321.63
9       10  424856.28
10      11  408846.35
11      12  421490.73

What is the highest single transaction amount recorded?

In [8]:
#It is the biggest single purchase amount in the data.
df["t_amt"].max()

200.0

Which service category contributes the most to total revenue?

In [38]:
#It is the service that brings the most money
df.groupby("services")["t_amt"].sum().idxmax()

'Outdoor Recreation'

Which product generated the highest revenue?

In [43]:
#It is the product that earned the most total sales.
high_rev=  df.groupby("products_used")["t_amt"].sum().idxmax()
high_rev

'Yoga & Pilates'

How does the average transaction amount vary between services?

In [47]:
#It shows how much people spend on average in each service.
x=df.groupby("services")["t_amt"].mean()
n=x.reset_index(name="Avg")
n

                  services         Avg
0               Air Sports  103.455104
1            Combat Sports  101.061761
2                  Dancing  102.907512
3       Exercise & Fitness  103.660247
4                    Games  102.272968
5               Gymnastics  102.385901
6             Indoor Games  103.074684
7                  Jumping  102.155171
8   Outdoor Play Equipment  101.281196
9       Outdoor Recreation  100.999480
10                 Puzzles  100.595997
11          Racquet Sports  103.647461
12             Team Sports  102.738998
13            Water Sports  101.899975
14           Winter Sports  101.217718

How many unique customers made purchases?

In [82]:
#It is the number of different customers who bought something.
df["cust_id"].nunique()

9926

Which customers have spent the most overall?

In [51]:
#These are the customers who spent the most money overall.
x=df.groupby("cust_id")["t_amt"].sum()
n=x.reset_index()
n.max()

cust_id    4009999.0
t_amt         1973.3
dtype: float64

What is the average number of transactions per customer?

In [53]:
#It shows how many times a customer usually buys.
df.groupby("cust_id").size().mean()

np.float64(5.037275841225066)

Are there customers who made multiple purchases in different categories?

In [55]:
#Yes,some customers buy from more than one service type.
x=df.groupby("cust_id")["services"].nunique()
n=x[x>1]
m=n.reset_index(name="Pur_Count")
m

      cust_id  Pur_Count
0     4000000          4
1     4000001          8
2     4000002          2
3     4000003          3
4     4000004          3
...       ...        ...
9483  4009995          4
9484  4009996          6
9485  4009997          4
9486  4009998          4
9487  4009999          5

[9488 rows x 2 columns]

Which product category has the highest total sales?

In [56]:
#It is the category that earned the most money.
df.groupby("services")["t_amt"].sum().idxmax()

'Outdoor Recreation'

Which services are most popular by transaction count?

In [57]:
#It is the service people use the most.
df["services"].value_counts().idxmax()

'Outdoor Recreation'

What is the average transaction amount per product type?

In [61]:
#It shows the usual spending for each product type.
x=df.groupby("products_used")["t_amt"].mean()
x

products_used
Abdominal Equipment    105.362798
Air Hockey             103.775478
Air Suits              101.421832
Archery                 97.345564
Badminton              108.441138
                          ...
Wetsuits               102.042775
Whitewater Rafting     102.877744
Windsurfing            104.161453
Wrestling               97.895364
Yoga & Pilates         107.668784
Name: t_amt, Length: 125, dtype: float64

Are there specific services where customers spend significantly more?

In [62]:
#Some services have higher spending than others.
df.groupby("services")["t_amt"].mean().sort_values(ascending=False)

services
Exercise & Fitness        103.660247
Racquet Sports            103.647461
Air Sports                103.455104
Indoor Games              103.074684
Dancing                   102.907512
Team Sports               102.738998
Gymnastics                102.385901
Games                     102.272968
Jumping                   102.155171
Water Sports              101.899975
Outdoor Play Equipment    101.281196
Winter Sports             101.217718
Combat Sports             101.061761
Outdoor Recreation        100.999480
Puzzles                   100.595997
Name: t_amt, dtype: float64

Which state has the highest total sales?

In [63]:
#It is the state where total sales are highest.
df.groupby("state")["t_amt"].sum().idxmax()

'California'

Which city records the highest number of transactions?

In [64]:
#It is the city with the most purchases.
f["city"].value_counts().idxmax()

'Pasadena'

What is the average spending per transaction in each state?

In [65]:
#It shows average purchase value in each state.
df.groupby("state")["t_amt"].mean()

state
Alabama                 102.487049
Arizona                 102.172241
California              102.652182
Colorado                101.537415
Connecticut              99.982108
District of Columbia    103.800334
Florida                 103.136567
Georgia                 102.330675
Hawaii                  101.536667
Idaho                    98.969538
Illinois                100.166315
Indiana                 100.712664
Iowa                    103.100727
Kansas                  101.436926
Kentucky                104.130392
Louisiana               103.466335
Maryland                100.506913
Massachusetts           104.541571
Michigan                101.547777
Minnesota               103.465157
Mississippi             101.214926
Missouri                100.969040
Nebraska                101.955690
Nevada                  105.434718
New Jersey              103.438005
New York                100.259452
North Carolina          103.033172
Ohio                    101.350817
Oklahoma                104.995771
Oregon                  102.438143
Pennsylvania            102.776034
South Carolina          103.540065
Tennessee                99.265804
Texas                   101.379891
Utah                    104.507560
Virginia                104.976206
Washington              101.401603
Wisconsin               101.953159
Name: t_amt, dtype: float64

In [ ]:
Which states buy the most Outdoor Recreation products?

In [66]:
#These states buy the most Outdoor Recreation items.
df[df["services"]=="Outdoor Recreation"]["state"].value_counts()

state
California              1188
Texas                    830
Florida                  483
Oregon                   335
Tennessee                313
Ohio                     307
Colorado                 279
Washington               276
Massachusetts            253
Arizona                  247
Missouri                 226
New Jersey               225
Illinois                 224
Alabama                  191
Virginia                 186
Wisconsin                180
Minnesota                169
South Carolina           162
Kentucky                 156
Kansas                   154
Pennsylvania             154
Georgia                  153
North Carolina           153
Michigan                 152
Nebraska                 149
New York                 140
Connecticut              140
Utah                     136
Nevada                   135
Indiana                   91
Idaho                     81
Maryland                  80
Mississippi               78
Louisiana                 77
Iowa                      74
Hawaii                    72
Oklahoma                  70
District of Columbia      64
Name: count, dtype: int64

Compare average spending between California and Texas customers.

In [67]:
#California customers spend a little more than Texas customers.
x=df.groupby("state")["t_amt"].mean()
x.loc[["California","Texas"]]

state
California    102.652182
Texas         101.379891
Name: t_amt, dtype: float64

Which quarter of the year saw the highest sales?

In [68]:
#It is the quarter with the highest total sales.
df.groupby(df["t_date"].dt.quarter)["t_amt"].sum().idxmax()

np.int32(3)

How does total sales vary month by month?

In [71]:
#Sales change from month to month.
df.groupby(df["t_date"].dt.month)["t_amt"].sum()

t_date
1     438165.76
2     395262.37
3     444664.24
4     420695.24
5     432627.58
6     421074.55
7     439560.80
8     434255.01
9     429321.63
10    424856.28
11    408846.35
12    421490.73
Name: t_amt, dtype: float64

What is the total number of transactions per month?

In [72]:
#It shows how many purchases happen each month.
df.groupby(df["t_date"].dt.month).size()

t_date
1     4268
2     3834
3     4360
4     4175
5     4205
6     4171
7     4252
8     4250
9     4160
10    4181
11    3994
12    4150
dtype: int64

How many transactions were done using credit?

In [73]:
#It shows how many purchases were paid by credit.
(df["t_details"]=="credit").sum()

np.int64(43151)

What is the total revenue generated from credit transactions?

In [74]:
#It shows how much money came from credit payments.
df[df["t_details"]=="credit"]["t_amt"].sum()

np.float64(4923134.93)

Is there a difference in average spending between credit and debit customers?

In [75]:
#Credit users usually spend more per purchase.
df.groupby("t_details")["t_amt"].mean()

t_details
cash       27.403360
credit    114.090865
Name: t_amt, dtype: float64

Which states or cities should the company focus on for marketing high-value products?

In [76]:
#Focus marketing on states and cities with high sales.
df.groupby("state")["t_amt"].sum().sort_values(ascending=False)

state
California              702346.23
Texas                   541267.24
Florida                 274858.95
Ohio                    188613.87
Oregon                  187052.05
Washington              181508.87
Colorado                178299.70
Tennessee               177685.79
Virginia                144447.26
Massachusetts           143744.66
New Jersey              136848.48
Illinois                134022.53
Missouri                132471.38
Arizona                 131291.33
Wisconsin               117144.18
Alabama                 116015.34
New York                 98755.56
Michigan                 98196.70
Nevada                   95418.42
South Carolina           94946.24
Kansas                   92713.35
Minnesota                92497.85
Utah                     92071.16
Nebraska                 91556.21
Connecticut              91083.70
Pennsylvania             90442.91
Kentucky                 90281.05
Georgia                  89437.01
North Carolina           87372.13
District of Columbia     49720.36
Louisiana                48836.11
Mississippi              47874.66
Oklahoma                 47668.08
Iowa                     46807.73
Idaho                    45031.14
Maryland                 44926.59
Indiana                  44615.71
Hawaii                   42950.01
Name: t_amt, dtype: float64

Should more inventory be stocked for Exercise & Fitness products given their popularity?

In [77]:
#Yes, more stock is needed because demand is high.
df[df["services"]=="Exercise & Fitness"].shape

(7394, 8)

Are there underperforming service categories that need promotional offers?

In [80]:
#Some services earn less and need offers or promotion.
df.groupby("services")["t_amt"].sum().sort_values().head(10)

services
Dancing                    42603.71
Puzzles                    61564.75
Air Sports                 99316.90
Combat Sports             164730.67
Racquet Sports            166976.06
Jumping                   205842.67
Indoor Games              288506.04
Outdoor Play Equipment    294728.28
Winter Sports             321973.56
Gymnastics                327225.34
Name: t_amt, dtype: float64